var shelter = {
  "木更津第一小学校": {lat: 35.384823, lng: 139.924227};
  "木更津第二小学校": {lat: 35.375813, lng: 139.92816};
  "東清小学校": {lat: 35.389467, lng: 139.983403};
  "西清小学校": {lat: 35.387589, lng: 139.938359};
  "南清小学校": {lat: 35.373098, lng: 139.969507};
  "清見台小学校": {lat: 35.381513, lng: 139.950744};
  "岩根小学校": {lat: 35.407484, lng: 139.927244};
  "高柳小学校": {lat: 35.41193, lng: 139.94813};
  "八幡台小学校": {lat: 35.340877, lng: 139.948204};
  "金田小学校": {lat: 35.425614, lng: 139.926386};
  "馬来田小学校": {lat: 35.369083, lng: 139.068304};
  "富岡小学校": {lat: 35.353628, lng: 139.039367};
  "祇園小学校": {lat: 35.38649, lng: 139.959062};
  "畑沢小学校": {lat: 35.342129, lng: 139.903824};
  "請西小学校": {lat: 35.374939, lng: 139.9441};
  "真舟小学校": {lat: 35.362346, lng: 139.93532};

  "木更津第一中学校": {lat: 35.385904, lng: 139.92454};
  "木更津第二中学校": {lat: 35.372811, lng: 139.937708};
  "木更津第三中学校": {lat: 35.388481, lng: 139.944755};
  "岩根中学校": {lat: 35.412319, lng: 139.944697};
  "岩根西中学校": {lat: 35.413611, lng: 139.923916};
  "太田中学校": {lat: 35.378066, lng: 139.948785};
  "畑沢中学校": {lat: 35.348012, lng: 139.914347};
  "波岡中学校": {lat: 35.341046, lng: 139.929827};
  "鎌足中学校": {lat: 35.34852, lng: 139.973449};
  "金田中学校": {lat: 35.427367, lng: 139.926255};
  "中郷中学校": {lat: 35.402471, lng: 139.986778};
  "清川中学校": {lat: 35.385298, lng: 139.970931};
  "富来田中学校": {lat: 35.368746, lng: 140.066087};

  "中央公民館" : {lat: 35.381119, lng: 139.924957};
  "文京公民館" : {lat: 35.377058, lng: 139.928407};
  "八幡台公民館" : {lat: 35.341605, lng: 139.951251};
  "東清公民館" : {lat: 35.38947, lng: 139.984333};
  "鎌足公民館" : {lat: 35.349684, lng: 139.976879};
  "中郷公民館" : {lat: 35.405584, lng: 139.970378};
  "富来田公民館" : {lat: 35.366771, lng: 140.060574};
  "岩根公民館" : {lat: 35.411966, lng: 139.941292};
  "金田公民館" : {lat: 35.433449, lng: 139.926249};
  "清見台公民館" : {lat: 35.379979, lng: 139.959243};
  "畑沢公民館" : {lat: 35.347687, lng: 139.912842};
  "岩根西公民館" : {lat: 35.40885, lng: 139.920742};
  "富岡公民館" : {lat: 35.35817, lng: 140.041653};
  "西清川公民館" : {lat: 35.390922, lng: 139.945077};
  "波岡公民館" : {lat: 35.344945, lng: 139.935927};
  "桜井公民館" : {lat: 35.365653, lng: 139.921314};
  "市民体育館" : {lat: 35.375838, lng: 139.921999};
  "木更津東高等学校" : {lat: 35.382784 , lng: 139.930646};
  "木更津高等学校" : {lat: 35.37435, lng: 139.933484};
  "拓殖大学紅陵高等学校" : {lat: 35.363523, lng: 139.928153};
  "志学館中等部・高等部" : {lat: 35.355089, lng: 139.931818};
  "木更津工業高等専門学校" : {lat: 35.385615 , lng: 139.962054};
  "木更津総合高等学校" : {lat: 35.37558, lng: 139.958119};
  "清和大学短期大学部" : {lat: 35.375222, lng: 139.956585};
}

function initMap(){
  var map = new google.maps.Map(document.getElementById('map'),{
    center: { lat: 35.3472396,  lng:140.017913},
    zoom: 50
  });
  var select = document.getElementById("shelter");
  select.addventListener("change", function(e) {
    var key = e.target.value;
    map.setCenter(shelter[key]);
  });
}
